## Merge, join, and concatenate

Классическая статья из документации Pandas - https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [1]:
import pandas as pd

In [2]:
raw_data = {
    'subject_id': ['1', '2', '3', '4', '5'],
    'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
    'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']
}
df_a = pd.DataFrame(raw_data, columns=['subject_id', 'first_name', 'last_name'])
df_a.index = [0, 1, 2, 3, 4]
df_a

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [3]:
raw_data = {
    'subject_id': ['4', '5', '6', '7', '8'],
    'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']
}
df_b = pd.DataFrame(raw_data, columns=['subject_id', 'first_name', 'last_name'])
df_b.index = [2, 3, 4, 5, 6]
df_b

  subject_id first_name last_name
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Balwner
5          7      Bryce     Brice
6          8      Betty    Btisan

In [4]:
raw_data = {
    'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
    'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]
}
df_n = pd.DataFrame(raw_data, columns=['subject_id', 'test_id'])
df_n

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

**Concat** как правило используется для объединения таблиц по вертикальной или горизонтальной оси.

In [5]:
df_new = pd.concat([df_a, df_b], axis=0)
df_new

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Balwner
5          7      Bryce     Brice
6          8      Betty    Btisan

In [6]:
df_new_ = pd.concat([df_a, df_b], axis=1)
df_new_

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson        NaN        NaN       NaN
1          2        Amy  Ackerman        NaN        NaN       NaN
2          3      Allen       Ali          4      Billy    Bonder
3          4      Alice      Aoni          5      Brian     Black
4          5     Ayoung   Atiches          6       Bran   Balwner
5        NaN        NaN       NaN          7      Bryce     Brice
6        NaN        NaN       NaN          8      Betty    Btisan

In [10]:
# Concat, но только с помощью атрибута "inner"
df_new_ = pd.concat([df_a, df_b], axis=1, join='inner')
df_new_

  subject_id first_name last_name subject_id first_name last_name
2          3      Allen       Ali          4      Billy    Bonder
3          4      Alice      Aoni          5      Brian     Black
4          5     Ayoung   Atiches          6       Bran   Balwner

**Append** - частный случай метода **Concat** с параметрами (axis=0, join='outer')

In [12]:
pd.concat([df_a, df_b], axis=0, join='outer')

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Balwner
5          7      Bryce     Brice
6          8      Betty    Btisan

Метод **Join** основан на объединении таблиц через индексы (способ объединения указывается с помощию параметра how=\['left', 'right', 'inner', 'outer']).

In [13]:
# df_a.joint(df_b, how='left')
df_a.join(df_b, rsuffix='_right_table', how='left')

,subject_id,first_name,last_name,subject_id_right_table,first_name_right_table,last_name_right_table
0,1,Alex,Anderson,NaN,NaN,NaN
1,2,Amy,Ackerman,NaN,NaN,NaN
2,3,Allen,Ali,4,Billy,Bonder
3,4,Alice,Aoni,5,Brian,Black
4,5,Ayoung,Atiches,6,Bran,Balwner

**Merge** используется для объединения таблиц по любым колонка с помощью left_on и right_on.

In [14]:
df_new

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
2          4      Billy    Bonder
3          5      Brian     Black
4          6       Bran   Balwner
5          7      Bryce     Brice
6          8      Betty    Btisan

In [15]:
# Стоит обратить внимание, что колонка subject_id не дублируется в новой таблице
pd.merge(df_new, df_n, on='subject_id')

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

In [16]:
pd.merge(df_new, df_n, left_on='subject_id', right_on='subject_id')

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

In [17]:
pd.merge(df_a, df_b, on='subject_id', how='left')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black

In [18]:
pd.merge(df_a, df_b, on='subject_id', how='right')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black
2          6          NaN         NaN         Bran     Balwner
3          7          NaN         NaN        Bryce       Brice
4          8          NaN         NaN        Betty      Btisan

In [19]:
pd.merge(df_a, df_b, right_index=True, left_index=True)

  subject_id_x first_name_x last_name_x subject_id_y first_name_y last_name_y
2            3        Allen         Ali            4        Billy      Bonder
3            4        Alice        Aoni            5        Brian       Black
4            5       Ayoung     Atiches            6         Bran     Balwner